{
  "stories": [
    {
      "name": "Ultimate Decentralisation",
      "keyword": "decentralisation",
      "timestamp": 1653418067000,
      "paragraphs": [
        "The dominance of cloud providers is intrinsically linked to centralisation of the internet, which facilitates easier censorship, financial monopolisation of servers, data privacy concerns: the list goes on. Decentralisation of digital society can only happen if big cloud players are either made redundant, or embrace change. So why this situation in the first place? HTTP is an amazing invention that is great for ease of use for developers, scalability and somewhat openness. It also facilitated the rise of big cloud. URLs are a mapping between client resources e.g. HTML file and the web server that serves the file. This largely 1-1 mapping lends to reliance on big cloud, as there is a central source of web server compute ability. IPFS, an alternate protocol, breaks this link by using Uniform Resource Hashes instead, meaning a greater pool of servers can cache the same resource, where each IPFS node (the equivalent to a HTTP web server) is part of a decentralised network. Each IPFS node caches all URHs they wish to host, and also caches other URHs that are served on the node. As requesting a resource is not tied to a particular server, any node that has an outage, is censored or is even too far away to serve a resource quick enough, is not a point of failure. Decentralisation from the ground up in this way would remove the problematic monopolisation of the internet."
      ],
      "theme": 0
    },
    {
      "name": "Endlessness",
      "keyword": "berlin",
      "timestamp": 1662410402000,
      "paragraphs": [
        "The techno beat reverberates around my head like a decaying neutron star, the dance moves express raw freedom, a feeling continually buried deep inside me by rainy gusts of English winter and a finance-driven social structure. Poetically an alternating rhythm emerges between the clinging of a digital bell and the clanging of an interdimensional tambourine, bringing forth a flurry of waving arms baked in the glow of red light. Colliding into another techno degen shifts focus to the scent of a collective filtered from the overworld by a policy of no aftershave, no high-fashion culture, disintegrated swarms of cookie-cut consumer products in the flesh and above all freedom. One, two, BANG, DROP and a platonic embrace holding them towards my essence joins the unanimous wave of punching to the electro-funk dials, rendering the omnipresent computerised instruments in an enveloping fractal ensemble of inhabitants joined together in spirit and fervour. This unified soul of a post-industrial clan synced together in music, self-expression and authentic ambition has become an irreversible part of my existence. An existence with the purpose of embracing one thing; our true selves.",
        "Flashing back to the isolated and reinvented remains of a wall torn down by such primordial passion, I see the illumination of the artwork frantically drawn over the concrete rendered ideological divide. A divide which will never be torn down but only highlighted by the metaphorical light of stoic wisdom; „Schauen…Glück, Berührung…Unglück“. A manufactured layer of kaleidoscopic platonic analysis, an analysis of everything we seek to escape from, illustrates the fleeting embrace of hedonism that will be seized as night temporarily hides this monument to a now decaying Zeitgeist. A hedonism that will forever breed restlessness and content rapt in synergy, an eternal synergy that I will never extinguish and carry forward as a flag-bearer for the reality of endless youth.",
        "Hedonism that began with the sculpting of Europe from endless beauty and calmness to a tribal battleground of forever conflicting egos. The scampering of a wild deer across the endlessly layered forest of Grunewald once morphed into a sense of relaxation as the reflective surface of the Grunewaldsee switched the deer's focus from the sly movements of rabid wolves, to the tranquillity of a lake locked away from campfires. Man-made energy that appeared as predatory flickers; a sign of the growing civilization replacing the once pervasive forests. An instantaneous pierce of an arrow transformed this natural balance into a frame of exploding flesh combined with the jeering of a hunting party; the Germanic jeering that became a residual part of the eternal air that will remain through the coming wave of industrialisation and modernity.",
        "Ascending to a Fernseher built to focus and absorb all the voluptuous passion of centuries elapsed, my panoramic vision perceives all my now inbuilt freedom and hedonism together in a perfect frame of beauty. An appetite for smokestack raving and the inbuilt cultural ego-drive inherited from rediscovered tribal ancestors heralds a final descent into holy debauchery. The essence of another utopian clan of prolific, post-industrial, pleasure-driven paradise will later cross the North Sea having transformed the synergy I seek to no longer be a flag-bearer for endless youth, but the definition of endless youth I have irreversibly embraced."
      ],
      "theme": 1
    }
  ]
}
